/*                   ·ð×æ±£ÓÓ             ÓÀÎÞBUG 
//                            _ooOoo_  
//                           o8888888o  
//                           88" . "88  
//                           (| -_- |)  
//                            O\ = /O  
//                        ____/`---'\____  
//                      .   ' \\| |// `.  
//                       / \\||| : |||// \
//                     / _||||| -:- |||||- \
//                       | | \\\ - /// | |  
//                     | \_| ''\---/'' | |  
//                      \ .-\__ `-` ___/-. /  
//                   ___`. .' /--.--\ `. . __  
//                ."" '< `.___\_<|>_/___.' >'"".  
//               | | : `- \`.;`\ _ /`;.`/ - ` : | |  
//                 \ \ `-. \_ __\ /__ _/ .-` / /  
//         ======`-.____`-.___\_____/___.-`____.-'======  
//                            `=---='  
//  
//         .............................................  
//                  ·ð×æ±£ÓÓ             ÓÀÎÞBUG 
*/
#include "sys.h"
#include "Posture.h"


int main(void)
{
#ifdef  USE_BLDR
	NVIC_SetVectorTable(NVIC_VectTab_FLASH, 0x3600);
#endif
    
    SysInit();
    
    xTaskCreate(Posture_Task, "main_task", 255, NULL, 2, NULL);

    vTaskStartScheduler();

    return 0;
}
















